; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph3 - mode
	infrared2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star3 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star4 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation13 - direction
	Star11 - direction
	GroundStation0 - direction
	GroundStation12 - direction
	Star6 - direction
	GroundStation14 - direction
	GroundStation1 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star10)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation14)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
)
(:goal (and
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 infrared2)
	(have_image Planet17 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 3
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
4. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 groundstation14)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite0 phenomenon16 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 3
7. (take_image satellite0 phenomenon16 instrument0 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 1 of 3
8. (turn_to satellite0 planet17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet17)
   goals met: 1 of 3
9. (take_image satellite0 planet17 instrument0 spectrograph3)
   added: (have_image planet17 spectrograph3)
   goals met: 2 of 3
10. (turn_to satellite1 planet15 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet15)
   goals met: 2 of 3
11. (take_image satellite1 planet15 instrument3 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 3 of 3
